data/cfdb/validation/lid_driven_cavity_re400/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10.0;

deltaT          0.001;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    probes
    {
        type            probes;
        libs            (fieldFunctionObjects);

        writeControl    timeStep;
        writeInterval   1;

        probeLocations
        (
            (0.05 0.005 0.005)
            (0.05 0.010 0.005)
            (0.05 0.015 0.005)
            (0.05 0.020 0.005)
            (0.05 0.025 0.005)
            (0.05 0.030 0.005)
            (0.05 0.035 0.005)
            (0.05 0.040 0.005)
            (0.05 0.045 0.005)
            (0.05 0.050 0.005)
            (0.05 0.055 0.005)
            (0.05 0.060 0.005)
            (0.05 0.065 0.005)
            (0.05 0.070 0.005)
            (0.05 0.075 0.005)
            (0.05 0.080 0.005)
            (0.05 0.085 0.005)
            (0.05 0.090 0.005)
            (0.05 0.095 0.005)
        );

        fields          ( U );
    }
}

// Reynolds number: 400
// Kinematic viscosity: 2.5e-4

// ************************************************************************* //
